app/views/courses/_form.html.erb

    <div class="row-fluid">
      <%= check_box_tag 'malla_ids[]', malla.id, @course.course_outlines.exists?(malla) -%>
---
SELECT "course_outlines".* FROM "course_outlines"