app/controllers/course_outlines_controller.rb

  def index
    @course_outlines = CourseOutline.all
---
SELECT "course_outlines".* FROM "course_outlines"

  def show
    @course_outline = CourseOutline.find(params[:id])
---
SELECT "course_outlines".* FROM "course_outlines" WHERE "course_outlines"."id" = $1 LIMIT 1  [["id", "3"]]

  def edit
    @course_outline = CourseOutline.find(params[:id])
---
SELECT "course_outlines".* FROM "course_outlines" WHERE "course_outlines"."id" = $1 LIMIT 1  [["id", "2"]]