app/controllers/courses_controller.rb

SELECT "course_outlines".* FROM "course_outlines"
---
  def new
    @course = Course.new
    @mallas = CourseOutline.all