app/controllers/identities_controller.rb

  def index
    	@identities = Identity.all
---
SELECT "identities".* FROM "identities"

  def edit
    @identity = Identity.find(params[:id])
---
SELECT "identities".* FROM "identities" WHERE "identities"."id" = $1 LIMIT 1  [["id", "2"]]

  def update
    @identity = Identity.find(params[:id])
---
SELECT "identities".* FROM "identities" WHERE "identities"."id" = $1 LIMIT 1  [["id", "2"]]