app/controllers/plan_controller.rb

  def malla
		@co = CourseOutline.find(params[:course_outline_id])
  	@s = params[:semester]
  	@con = (Contain.where(:semester => @s) & Contain.where(:course_outline_id => @co.id))

  	@courses = []
	  @con.map { |e|
	  	@courses << Course.find(e.course_id)
---
SELECT "course_outlines".* FROM "course_outlines" WHERE "course_outlines"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "contains".* FROM "contains" WHERE "contains"."course_outline_id" = 2
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", 4]]

  def curso
		@co = CourseOutline.find(params[:course_outline_id])
  	@s = params[:semester]
  	@c = Course.find(params[:course_id])
  	@con = (Contain.where(:semester => @s) & Contain.where(:course_outline_id => @co.id))

  	@courses = []
	  @con.map { |e|
---
SELECT "course_outlines".* FROM "course_outlines" WHERE "course_outlines"."id" = $1 LIMIT 1  [["id", "2"]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", "4"]]
SELECT "contains".* FROM "contains" WHERE "contains"."course_outline_id" = 2