app/controllers/resources_controller.rb

SELECT "identities".* FROM "identities" WHERE "identities"."id" = $1 LIMIT 1  [["id", 1]]
---
	def new

		@identity = Identity.find(params[:identity_id])