app/controllers/resources_controller.rb

SELECT "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT 1  [["id", "21"]]
SELECT "identities".* FROM "identities" WHERE "identities"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@resource = Resource.find(params[:id])
		idUser = session[:user_id]
		@identity =  Identity.find(idUser)

SELECT "identities".* FROM "identities" WHERE "identities"."id" = $1 LIMIT 1  [["id", "1"]]
---
	def index
		#idUser = session[:user_id]

		@identity =  Identity.find(params[:identity_id])

SELECT "resources".* FROM "resources"
SELECT "identities".* FROM "identities" WHERE "identities"."id" = $1 LIMIT 1  [["id", "1"]]
---
	def all
		@resources = Resource.all
		@identity =  Identity.find(params[:identity_id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", "4"]]
---
	def new
		@course = Course.find(params[:course_id])

SELECT "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT 1  [["id", "4"]]
INSERT INTO "resources" ("course_id", "created_at", "description", "file_content_type", "file_file_name", "file_file_size", "grade", "identity_id", "professor", "resource_type", "tiene_codigo", "title", "updated_at", "visible") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
SELECT "identities".* FROM "identities" WHERE "identities"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "resources" SET "identity_id" = 2, "updated_at" = '2013-07-17 16:59:14.363541' WHERE "resources"."id" = 39
---
	def create
		#Necesito el semenstre y el curso para volver a ramo.
		semester = params[:resource].delete("semester")	 #elimino el hidden_field
		course_outline_id = params[:resource].delete("course_outline_id")	#elimino el hidden_field

		@course = Course.find(params[:course_id])
		@resource = @course.resources.create(params[:resource])

		idUser = session[:user_id]
		identity_f =  Identity.find(idUser)
		@resource.identity = identity_f

		if @resource.save

SELECT "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT 1  [["id", "21"]]
SELECT "identities".* FROM "identities" WHERE "identities"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def edit
    @resource = Resource.find(params[:id])
    @identity =  Identity.find(params[:identity_id])

SELECT "resources".* FROM "resources" WHERE "resources"."id" = $1 LIMIT 1  [["id", "21"]]
UPDATE "resources" SET "visible" = 't', "updated_at" = '2013-07-17 05:10:41.980935' WHERE "resources"."id" = 21
---
  def update
    @resource = Resource.find(params[:id])


	if params[:commit].eql?("Editar")
		if @resource.update_attributes(params[:resource])