app/controllers/sessions_controller.rb

	def create
		user = User.from_omniauth(env["omniauth.auth"])
		session[:user_id] = user.id

		#GUARDO LA CANTIDAD DE RECURSOS INVISIBLES
		identity = Identity.find(user.id)
---
SELECT "identities".* FROM "identities" WHERE "identities"."id" = $1 LIMIT 1  [["id", 1]]