app/views/plan/curso.html.erb

            <td><%= resource.resource_type %></td>
            <td align ="center"><%= resource.comments.count %></td>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."resource_id" = 23