app/views/layouts/_navigation.html.erb

SELECT "identities".* FROM "identities" WHERE "identities"."id" = $1 LIMIT 1  [["id", 1]]
---

          <% identity =  Identity.find(idUser) %>

SELECT "course_outlines".* FROM "course_outlines"
---
              <ul class="dropdown-menu">
                <%CourseOutline.all.map { |co| %>